if __name__ == "__main__":

    print("")

    print("Изменение цены с закрытия 19.02.20 по настоящий момент составляют: ")
    print("")


    # x[0] == Тикер, x[1] == первая цена, x[2] == вторая цена
    a = ["SnP", 3386.16, 3116.40]
    b = ["Voo", 310.92, 285.78]
    c = ["BA", 338.26, 305]
    d = ["AAL", 28.33, 22.39]
    e = ["MCD", 215.63, 209.10]
    f = ["RCL", 110.98, 82.03]
    g = ["LTC", 48.49, 49.31]
    h = ["SPPP", 18.03, 17.97]
    i = ["USD", 63.52, 65.48]
    j = ["XXX", 00.00, 00.00]
    k = ["XXX", 00.00, 00.00]


    for l in [a,b,c,d,e,f,g,h,i,j,k]:
        if l[1] > l[2]:
            if l[1] or l[2] != 00.00:
                z = 100 * (l[1] - l[2]) / l[1]
                z = str("%.4f" % z) # 4 знака после запятой
                print('\x1b[6;30;41m' + " % " + '\x1b[0m' + " " + l[0] + " -" + z ) #цвет красный
            else:
                l = l.remove(l[1])
        elif l[1] < l[2]:
            if l[1] or l[2] != 00.00:
                z = 100 * (l[2] - l[1]) / l[1]
                z = str("%.4f" % z) # 4 знака после запятой
                print('\x1b[1;30;42m' + " % " + '\x1b[0m' + " " + l[0] + " +" + z) #цвет зелёный
            else:
                l = l.remove(l[1])
        elif l[1] == l[2]:
            if l[1] or l[2] != 00.00:
                z = 100 * (l[2] - l[1]) / l[1]
                z = str("%.4f" % z) # 4 знака после запятой
                print('\x1b[7;36;40m' + " % " + '\x1b[0m' + " " + l[0] + " " + z) #цвет голубой
            else:
                l = l.remove(l[1])



